# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\bryan.lee\Documents\GitHub\hello-world\Cypress\EQF1248 Fan Fixture\Code\Fan Fixture.cydsn\Fan Fixture.cyprj
# Date: Wed, 30 May 2018 20:56:04 GMT
#set_units -time ns
create_clock -name {adcVFan_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {clkDisplay(routed)} -period 200012207.03125 -waveform {0 100006103.515625} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {CyXTAL_32kHz} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/clk_32k_xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {adcVFan_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {adcVFan_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 11 23} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {clkPWM2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 33} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {clkPWM} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {clkDisplay} -source [get_pins {ClockBlock/clk_sync}] -edges {1 4800293 9600585} -nominal_period 200012207.03125 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {clkDebounce} -source [get_pins {ClockBlock/clk_sync}] -edges {1 400001 800001} [list [get_pins {ClockBlock/dclk_glb_3}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\bryan.lee\Documents\GitHub\hello-world\Cypress\EQF1248 Fan Fixture\Code\Fan Fixture.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\bryan.lee\Documents\GitHub\hello-world\Cypress\EQF1248 Fan Fixture\Code\Fan Fixture.cydsn\Fan Fixture.cyprj
# Date: Wed, 30 May 2018 20:55:53 GMT
