# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\bryan.lee\Documents\PSoC Creator\Joystick_Test_2.2\ADC_SingleEndedMode01\ADC_SingleEndedMode01.cydsn\ADC_SingleEndedMode01.cyprj
# Date: Fri, 28 Apr 2017 18:51:28 GMT
#set_units -time ns
create_clock -name {ADC_DelSig_1_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyXTAL_32kHz} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/clk_32k_xtal}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 733 1465} -nominal_period 30517.578125 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 733 1465} -nominal_period 30517.578125 [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {Clock_1(fixed-function)} -period 30500 -waveform {0 15258.7890625} -nominal_period 30517.578125 [get_pins {ClockBlock/aclk_glb_ff_0}]
create_clock -name {ADC_DelSig_1_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\bryan.lee\Documents\PSoC Creator\Joystick_Test_2.2\ADC_SingleEndedMode01\ADC_SingleEndedMode01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\bryan.lee\Documents\PSoC Creator\Joystick_Test_2.2\ADC_SingleEndedMode01\ADC_SingleEndedMode01.cydsn\ADC_SingleEndedMode01.cyprj
# Date: Fri, 28 Apr 2017 18:51:23 GMT
