# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\bryan.lee\Desktop\PSoC-6-MCU-Pioneer-Kits-master\CY8CKIT-062-BLE Pioneer Kit\CE218133_EINK_CapSense\CE218133_EINK_CapSense.cydsn\CE218133_EINK_CapSense.cyprj
# Date: Sun, 10 Nov 2019 06:37:25 GMT
#set_units -time ns
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyClk_LF} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 10.416666666666666 -waveform {0 5.20833333333333} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 10.416666666666666 -waveform {0 5.20833333333333} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 10.416666666666666 -waveform {0 5.20833333333333} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 10.416666666666666 -waveform {0 5.20833333333333} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/periclk}] -edges {1 255 511} [list [get_pins {ClockBlock/ff_div_43}]]
create_generated_clock -name {EINK_Clock} -source [get_pins {ClockBlock/periclk}] -edges {1 48001 96001} [list [get_pins {ClockBlock/ff_div_11}]]
create_generated_clock -name {CY_EINK_SPIM_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/ff_div_6}]]
create_clock -name {CyPeriClk_App} -period 10.416666666666666 -waveform {0 5.20833333333333} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\bryan.lee\Desktop\PSoC-6-MCU-Pioneer-Kits-master\CY8CKIT-062-BLE Pioneer Kit\CE218133_EINK_CapSense\CE218133_EINK_CapSense.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\bryan.lee\Desktop\PSoC-6-MCU-Pioneer-Kits-master\CY8CKIT-062-BLE Pioneer Kit\CE218133_EINK_CapSense\CE218133_EINK_CapSense.cydsn\CE218133_EINK_CapSense.cyprj
# Date: Sun, 10 Nov 2019 06:37:05 GMT
